# 12_集合set_detail.py
# 2025/1/24   20:21

# 集合是无序的,不重复的数据序列
# 集合是可变序列
# 集合的定义:
# 1) 使用{}定义集合,元素之间使用逗号分隔
# 2) 使用内置函数set()定义集合
# 3) 定义空集合只能使用set()

# 集合的特点:
# 1) 集合中的元素不允许重复
# 2) 集合是无序的
# 3) 集合中的元素必须是不可变对象
# 4) 集合是可变序列

# 集合的创建
set_A = {10, 20, 30, 40, 50}
print(set_A)  # {50, 20, 40, 10, 30}

# 集合的遍历
for i in set_A:
    print(i)

# 集合的添加
set_A.add(60)
print(set_A)  # {50, 20, 40, 10, 60, 30}

# 集合的删除
set_A.remove(60)
print(set_A)  # {50, 20, 40, 10, 30}

# 集合的清空
set_A.clear()
print(set_A)  # set() 