# 13_集合常用操作.py
# 2025/1/24   20:35

# 集合的关系运算
# 1) 交集运算: &
# 2) 并集运算: |
# 3) 差集运算: -
# 4) 对称差集运算: ^

set_A = {10, 20, 30, 40, 50}
set_B = {30, 40, 50, 60, 70}

# 交集运算
print(set_A & set_B)  # {40, 50, 30}

# 并集运算
print(set_A | set_B)  # {50, 20, 70, 40, 10, 60, 30}

# 差集运算
print(set_A - set_B)  # {10, 20}

# 对称差集运算
print(set_A ^ set_B)  # {20, 70, 10, 60}

# 集合的判断
# 1) 判断两个集合是否相等: ==
# 2) 判断一个集合是否是另一个集合的子集: <=
# 3) 判断一个集合是否是另一个集合的超集: >=

set_C = {10, 20, 30}
set_D = {10, 20, 30}

# 判断两个集合是否相等
print(set_C == set_D)  # True

# 判断一个集合是否是另一个集合的子集
print(set_C <= set_A)  # False

# 判断一个集合是否是另一个集合的超集
print(set_A >= set_C)  # False 